{
  "product_code": "76181-190",
  "product_name": "VWR® Laboratory Centrifuge, 115 V\nVWR® Laboratory centrifuge, 115 V, 12×16×10.5\"",
  "model_number": null,
  "description": "About this item\nVersatile and economical, the VWR® Laboratory Centrifuge accepts up to 6 interchangeable rotors providing flexibility and ease of use.\nAccepts all common tube sizes up to 50 ml\nDigital speed control\nSpins up to 4000 rpm/2504 xg\nLCD display\nMicroprocessor control\nImbalance sensor\nIntegrated safety lid-lock\nThe VWR® Laboratory Centrifuge is uniquely designed to accept up to 6 interchangeable rotors, making it the most flexible centrifuge in its class\nUnlike most compact centrifuges, the VWR® Laboratory Centrifuge also offers a high capacity, 24 position rotors for blood collection tubes. This dual row rotor directly accepts 10 ml blood collections tubes or smaller tubes with the use of adapters.\nAll rotors are easily interchangeable using the unit's included rotor wrench and can be removed for complete cleaning of the centrifuge chamber.\nThe unit's back-lit LCD display provides control over centrifuge speed and run times. Speed can be set and viewed in rpm/rcf, and acceleration and deceleration parameters can be easily adjusted in the advanced settings mode.\nFor horizontal separations, a six position swing out rotor is available for 10-15 ml tubes, as well as smaller tubes with the use of adapters. There are also a variety of fixed angle rotors available for tubes up to 50 ml.\nCertifications: CE marked.\nOrdering information: Rotors sold separately.",
  "price": "1707.31",
  "currency": "$",
  "specifications": {
    "Description": "VWR® Laboratory centrifuge",
    "Dimensions": "12×16×10.5\"",
    "Cat. No.": "76181-190",
    "Electrical": "115 V"
  },
  "availability": "New Customer Promotional Price\nLog in for availability",
  "url": "https://www.avantorsciences.com/us/en/product/NA4568464/vwr-laboratory-centrifuge-115-v?isCatNumSearch=true&searchedCatalogNumber=76181-190"
}